Documents/ЗаменаСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаменаСчетчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СчетчикиБоксов</xr:Item>
				<xr:Item>InformationRegister.СчетчикиВводов</xr:Item>
				<xr:Item>InformationRegister.ТекущиеПоказания</xr:Item>
				<xr:Item>AccumulationRegister.ПотреблениеЭлектроэнергии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеСтарогоПриДемонтаже</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальноеПоказаниеНового</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотреблениеДоДемонтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятПрежний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПотреблениеЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ПотреблениеЭлектроэнергии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КвтЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиВводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиВводов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийПриборУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПриборУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаменаСчетчика/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СтарыйСчетчик.Пустая() Или НовыйСчетчик.Пустая() Тогда
		Возврат;	
	КонецЕсли;
	ЭтоОбщий = СтарыйСчетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ОбщийПриборУчета;
	Если ЭтоОбщий Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Бокс");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);	
		КонецЕсли;
	ИначеЕсли Бокс.Пустая() Тогда
		Сообщить("Для индивидуального счётчика укажите бокс.");
		Отказ = Истина;
	КонецЕсли; 
	Если СтарыйСчетчик = НовыйСчетчик Тогда
		Сообщить("Старый и новый счётчики совпадают.");
		Отказ = Истина;
	КонецЕсли;
	Если СтарыйСчетчик.ТипСчетчика <> НовыйСчетчик.ТипСчетчика Тогда
		Сообщить("Типы счётчиков должны совпадать.");
		Отказ = Истина; 
	КонецЕсли;
	
	Если ЭлектроУчет.СчетчикВЭксплуатации(НовыйСчетчик, Дата - 1) Тогда
		Сообщить("Новый счётчик на дату документа уже где-то установлен.");
		Отказ = Истина;  
	КонецЕсли;
	Если ПоказаниеСтарогоПриДемонтаже < 0 ИЛИ НачальноеПоказаниеНового < 0 Тогда
		Сообщить("Показания не могут быть отрицательными.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если СтарыйСчетчик.Пустая() ИЛИ НовыйСчетчик.Пустая() Тогда
		Сообщить("Не указаны счётчики."); Отказ = Истина; Возврат;
	КонецЕсли;
	
	ЭтоОбщий = СтарыйСчетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ОбщийПриборУчета;
	МоментДо = Дата - 1;
	ЭтоПерепроведение = НЕ Ссылка.Пустая() И Ссылка.Проведен;
	
	// --- контроли состояния ---
	Если Не ЭлектроУчет.СчетчикВЭксплуатации(СтарыйСчетчик, МоментДо) И НЕ ЭтоПерепроведение Тогда
		Сообщить("Старый счётчик на дату замены нигде не установлен (снят или не ставился).");
		Отказ = Истина;
	КонецЕсли;
	Если ЭтоОбщий Тогда
	ВводЗамены = ЭлектроУчет.ВводСчетчикаНаДату(СтарыйСчетчик, МоментДо);
	Если ВводЗамены.Пустая() Тогда
		Сообщить("Старый счётчик не числится установленным на вводе - проверьте историю установок.");
	    Отказ = Истина;
	КонецЕсли;
	Если ЭлектроУчет.ЕстьОперацииСВводомВДату(ВводЗамены, Дата,Ссылка) Тогда
		Сообщить("С этим вводом в ту же дату уже есть документ установки/замены.");
		Отказ = Истина;
	КонецЕсли;
	КонецЕсли;
	ЗанятыйБокс = ЭлектроУчет.БоксСчетчикаНаДату(НовыйСчетчик, МоментДо);
	Если НЕ ЗанятыйБокс.Пустая() Тогда
		Сообщить("Новый счётчик уже числится на боксе " + Строка(ЗанятыйБокс) + ".");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЭтоОбщий Тогда
		Числится = ЭлектроУчет.СчетчикБоксаНаДату(Бокс, МоментДо);
		Если Числится <> СтарыйСчетчик Тогда
			Сообщить("На боксе " + Строка(Бокс) + " на дату замены числится "
			+ ?(Числится.Пустая(), "нет счётчика", "другой счётчик (" + Строка(Числится) + ")") + ".");
			Отказ = Истина;
		КонецЕсли;
		Если ЭлектроУчет.ЕстьОперацииСБоксомВДату(Бокс, Дата, Ссылка) Тогда
			Сообщить("С этим боксом в ту же дату уже есть документ установки/замены.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлектроУчет.ЕстьПоказанияПосле(СтарыйСчетчик, Дата) Тогда
		Сообщить("По старому счётчику есть показания позже даты замены — исправьте дату документа.");
		Отказ = Истина;
	КонецЕсли;
	Если ЭлектроУчет.ЕстьПоказанияПосле(НовыйСчетчик, Дата) Тогда
		Сообщить("По новому счётчику есть показания позже даты замены — замена задним числом невозможна.");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	// --- расчёт потребления до демонтажа ---
	Предыдущее = ЭлектроУчет.ТекущееПоказаниеЧисло(СтарыйСчетчик, МоментДо);
	Расчет = ЭлектроУчет.ДельтаПоказаний(СтарыйСчетчик, Предыдущее, ПоказаниеСтарогоПриДемонтаже);
	Если НЕ Расчет.Успех Тогда
		Сообщить("Старый счётчик: " + Расчет.Сообщение);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПотреблениеДоДемонтажа = Расчет.Дельта;
	
	// --- движения ---
	Если ПотреблениеДоДемонтажа > 0 Тогда
		Движения.ПотреблениеЭлектроэнергии.Записывать = Истина;
		Движение = Движения.ПотреблениеЭлектроэнергии.Добавить();
		Движение.Период = Дата;
		Движение.Счетчик = СтарыйСчетчик;
		Движение.ТипСчетчика = СтарыйСчетчик.ТипСчетчика;
		Движение.КвтЧ = ПотреблениеДоДемонтажа;
		Если НЕ ЭтоОбщий Тогда
			Движение.Бокс = Бокс;
			Движение.Ввод = Бокс.Ввод;
		Иначе
			Движение.Ввод = ВводЗамены;
		КонецЕсли;
	КонецЕсли;
	
	Движения.ТекущиеПоказания.Записывать = Истина;
	Движение = Движения.ТекущиеПоказания.Добавить();
	Движение.Период = Дата;
	Движение.Счетчик = СтарыйСчетчик;
	Движение.Показание = ПоказаниеСтарогоПриДемонтаже;
	
	Движение = Движения.ТекущиеПоказания.Добавить();
	Движение.Период = Дата;
	Движение.Счетчик = НовыйСчетчик;
	Движение.Показание = НачальноеПоказаниеНового;
	
	Если ЭтоОбщий Тогда
		ВводЗамены = ЭлектроУчет.ВводСчетчикаНаДату(СтарыйСчетчик, МоментДо);
		Движения.СчетчикиВводов.Записывать = Истина;
		Движение = Движения.СчетчикиВводов.Добавить();
		Движение.Период = Дата;
		Движение.Бокс = Бокс;
		Движение.Счетчик = НовыйСчетчик;
	Иначе
		Движения.СчетчикиБоксов.Записывать = Истина;
		Движение = Движения.СчетчикиБоксов.Добавить();
		Движение.Период = Дата;
		Движение.Бокс = Бокс;
		Движение.Счетчик = НовыйСчетчик;
	КонецЕсли;
КонецПроцедуры
